# Schala

Scheme interpreter in Scala.
Implemented to learn Scala, this interpreter is woefully inadequate.

# Usage

	scalac Scheme.scala
	scala Scheme

	> (+ 1 2)
	3
	> (define r 10)
	null
	> (define g 20)
	null
	> (define add (lambda x y (+ x y)))
	null
	> (add r g)
	30
	> 

